Revit 2017 API
BaseLoadOn Enumeration
An enumerated type listing all the possible power load use types for a space object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public enum BaseLoadOn
Visual Basic
Public Enumeration BaseLoadOn
Visual C++
public enum class BaseLoadOn
Members
Member name | Description
kUseDefaultLoad | Return BaseLoadOn is UseDefaultLoad.
kUseEnteredLoad | Return BaseLoadOn is UseEnteredLoad.
kUseCalculatedLoad | Return BaseLoadOn is UseCalculatedLoad.
kUseActualLoad | Return BaseLoadOn is UseActualLoad.
kNoOfBaseLoadOnMethods | Return BaseLoadOn is NoOfBaseLoadOnMethods.
See Also
Autodesk.Revit.DB Namespace